zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/xdmac.h
#define XDMAC_GE_EN_Pos                     0                                              /**< (XDMAC_GE Position) XDMAC Channel 23 Enable Bit */
#define XDMAC_GE_EN_Msk                     (_U_(0xFFFFFF) << XDMAC_GE_EN_Pos)             /**< (XDMAC_GE Mask) EN */
#define XDMAC_GE_EN(value)                  (XDMAC_GE_EN_Msk & ((value) << XDMAC_GE_EN_Pos))  

/* -------- XDMAC_GD : (XDMAC Offset: 0x20) (/W 32) Global Channel Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DI0:1;                     /**< bit:      0  XDMAC Channel 0 Disable Bit              */
    uint32_t DI1:1;                     /**< bit:      1  XDMAC Channel 1 Disable Bit              */
    uint32_t DI2:1;                     /**< bit:      2  XDMAC Channel 2 Disable Bit              */
    uint32_t DI3:1;                     /**< bit:      3  XDMAC Channel 3 Disable Bit              */
    uint32_t DI4:1;                     /**< bit:      4  XDMAC Channel 4 Disable Bit              */
    uint32_t DI5:1;                     /**< bit:      5  XDMAC Channel 5 Disable Bit              */
    uint32_t DI6:1;                     /**< bit:      6  XDMAC Channel 6 Disable Bit              */
    uint32_t DI7:1;                     /**< bit:      7  XDMAC Channel 7 Disable Bit              */
    uint32_t DI8:1;                     /**< bit:      8  XDMAC Channel 8 Disable Bit              */
    uint32_t DI9:1;                     /**< bit:      9  XDMAC Channel 9 Disable Bit              */
    uint32_t DI10:1;                    /**< bit:     10  XDMAC Channel 10 Disable Bit             */
    uint32_t DI11:1;                    /**< bit:     11  XDMAC Channel 11 Disable Bit             */
    uint32_t DI12:1;                    /**< bit:     12  XDMAC Channel 12 Disable Bit             */
    uint32_t DI13:1;                    /**< bit:     13  XDMAC Channel 13 Disable Bit             */
    uint32_t DI14:1;                    /**< bit:     14  XDMAC Channel 14 Disable Bit             */
    uint32_t DI15:1;                    /**< bit:     15  XDMAC Channel 15 Disable Bit             */
    uint32_t DI16:1;                    /**< bit:     16  XDMAC Channel 16 Disable Bit             */
    uint32_t DI17:1;                    /**< bit:     17  XDMAC Channel 17 Disable Bit             */
    uint32_t DI18:1;                    /**< bit:     18  XDMAC Channel 18 Disable Bit             */
    uint32_t DI19:1;                    /**< bit:     19  XDMAC Channel 19 Disable Bit             */
    uint32_t DI20:1;                    /**< bit:     20  XDMAC Channel 20 Disable Bit             */
    uint32_t DI21:1;                    /**< bit:     21  XDMAC Channel 21 Disable Bit             */
    uint32_t DI22:1;                    /**< bit:     22  XDMAC Channel 22 Disable Bit             */
    uint32_t DI23:1;                    /**< bit:     23  XDMAC Channel 23 Disable Bit             */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t DI:24;                     /**< bit:  0..23  XDMAC Channel 23 Disable Bit             */
    uint32_t :8;                        /**< bit: 24..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} XDMAC_GD_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define XDMAC_GD_OFFSET                     (0x20)                                        /**<  (XDMAC_GD) Global Channel Disable Register  Offset */

#define XDMAC_GD_DI0_Pos                    0                                              /**< (XDMAC_GD) XDMAC Channel 0 Disable Bit Position */
#define XDMAC_GD_DI0_Msk                    (_U_(0x1) << XDMAC_GD_DI0_Pos)                 /**< (XDMAC_GD) XDMAC Channel 0 Disable Bit Mask */
#define XDMAC_GD_DI0                        XDMAC_GD_DI0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI0_Msk instead */
#define XDMAC_GD_DI1_Pos                    1                                              /**< (XDMAC_GD) XDMAC Channel 1 Disable Bit Position */
#define XDMAC_GD_DI1_Msk                    (_U_(0x1) << XDMAC_GD_DI1_Pos)                 /**< (XDMAC_GD) XDMAC Channel 1 Disable Bit Mask */
#define XDMAC_GD_DI1                        XDMAC_GD_DI1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI1_Msk instead */
#define XDMAC_GD_DI2_Pos                    2                                              /**< (XDMAC_GD) XDMAC Channel 2 Disable Bit Position */
#define XDMAC_GD_DI2_Msk                    (_U_(0x1) << XDMAC_GD_DI2_Pos)                 /**< (XDMAC_GD) XDMAC Channel 2 Disable Bit Mask */
#define XDMAC_GD_DI2                        XDMAC_GD_DI2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI2_Msk instead */
#define XDMAC_GD_DI3_Pos                    3                                              /**< (XDMAC_GD) XDMAC Channel 3 Disable Bit Position */
#define XDMAC_GD_DI3_Msk                    (_U_(0x1) << XDMAC_GD_DI3_Pos)                 /**< (XDMAC_GD) XDMAC Channel 3 Disable Bit Mask */
#define XDMAC_GD_DI3                        XDMAC_GD_DI3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI3_Msk instead */
#define XDMAC_GD_DI4_Pos                    4                                              /**< (XDMAC_GD) XDMAC Channel 4 Disable Bit Position */
#define XDMAC_GD_DI4_Msk                    (_U_(0x1) << XDMAC_GD_DI4_Pos)                 /**< (XDMAC_GD) XDMAC Channel 4 Disable Bit Mask */
#define XDMAC_GD_DI4                        XDMAC_GD_DI4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI4_Msk instead */
#define XDMAC_GD_DI5_Pos                    5                                              /**< (XDMAC_GD) XDMAC Channel 5 Disable Bit Position */
#define XDMAC_GD_DI5_Msk                    (_U_(0x1) << XDMAC_GD_DI5_Pos)                 /**< (XDMAC_GD) XDMAC Channel 5 Disable Bit Mask */
#define XDMAC_GD_DI5                        XDMAC_GD_DI5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI5_Msk instead */
#define XDMAC_GD_DI6_Pos                    6                                              /**< (XDMAC_GD) XDMAC Channel 6 Disable Bit Position */
#define XDMAC_GD_DI6_Msk                    (_U_(0x1) << XDMAC_GD_DI6_Pos)                 /**< (XDMAC_GD) XDMAC Channel 6 Disable Bit Mask */
#define XDMAC_GD_DI6                        XDMAC_GD_DI6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI6_Msk instead */
#define XDMAC_GD_DI7_Pos                    7                                              /**< (XDMAC_GD) XDMAC Channel 7 Disable Bit Position */
#define XDMAC_GD_DI7_Msk                    (_U_(0x1) << XDMAC_GD_DI7_Pos)                 /**< (XDMAC_GD) XDMAC Channel 7 Disable Bit Mask */
#define XDMAC_GD_DI7                        XDMAC_GD_DI7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI7_Msk instead */
#define XDMAC_GD_DI8_Pos                    8                                              /**< (XDMAC_GD) XDMAC Channel 8 Disable Bit Position */
#define XDMAC_GD_DI8_Msk                    (_U_(0x1) << XDMAC_GD_DI8_Pos)                 /**< (XDMAC_GD) XDMAC Channel 8 Disable Bit Mask */
#define XDMAC_GD_DI8                        XDMAC_GD_DI8_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI8_Msk instead */
#define XDMAC_GD_DI9_Pos                    9                                              /**< (XDMAC_GD) XDMAC Channel 9 Disable Bit Position */
#define XDMAC_GD_DI9_Msk                    (_U_(0x1) << XDMAC_GD_DI9_Pos)                 /**< (XDMAC_GD) XDMAC Channel 9 Disable Bit Mask */
#define XDMAC_GD_DI9                        XDMAC_GD_DI9_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI9_Msk instead */
#define XDMAC_GD_DI10_Pos                   10                                             /**< (XDMAC_GD) XDMAC Channel 10 Disable Bit Position */
#define XDMAC_GD_DI10_Msk                   (_U_(0x1) << XDMAC_GD_DI10_Pos)                /**< (XDMAC_GD) XDMAC Channel 10 Disable Bit Mask */
#define XDMAC_GD_DI10                       XDMAC_GD_DI10_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI10_Msk instead */
#define XDMAC_GD_DI11_Pos                   11                                             /**< (XDMAC_GD) XDMAC Channel 11 Disable Bit Position */
#define XDMAC_GD_DI11_Msk                   (_U_(0x1) << XDMAC_GD_DI11_Pos)                /**< (XDMAC_GD) XDMAC Channel 11 Disable Bit Mask */
#define XDMAC_GD_DI11                       XDMAC_GD_DI11_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI11_Msk instead */
#define XDMAC_GD_DI12_Pos                   12                                             /**< (XDMAC_GD) XDMAC Channel 12 Disable Bit Position */
#define XDMAC_GD_DI12_Msk                   (_U_(0x1) << XDMAC_GD_DI12_Pos)                /**< (XDMAC_GD) XDMAC Channel 12 Disable Bit Mask */
#define XDMAC_GD_DI12                       XDMAC_GD_DI12_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI12_Msk instead */
#define XDMAC_GD_DI13_Pos                   13                                             /**< (XDMAC_GD) XDMAC Channel 13 Disable Bit Position */
#define XDMAC_GD_DI13_Msk                   (_U_(0x1) << XDMAC_GD_DI13_Pos)                /**< (XDMAC_GD) XDMAC Channel 13 Disable Bit Mask */
#define XDMAC_GD_DI13                       XDMAC_GD_DI13_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI13_Msk instead */
#define XDMAC_GD_DI14_Pos                   14                                             /**< (XDMAC_GD) XDMAC Channel 14 Disable Bit Position */
#define XDMAC_GD_DI14_Msk                   (_U_(0x1) << XDMAC_GD_DI14_Pos)                /**< (XDMAC_GD) XDMAC Channel 14 Disable Bit Mask */
#define XDMAC_GD_DI14                       XDMAC_GD_DI14_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI14_Msk instead */
#define XDMAC_GD_DI15_Pos                   15                                             /**< (XDMAC_GD) XDMAC Channel 15 Disable Bit Position */
#define XDMAC_GD_DI15_Msk                   (_U_(0x1) << XDMAC_GD_DI15_Pos)                /**< (XDMAC_GD) XDMAC Channel 15 Disable Bit Mask */
#define XDMAC_GD_DI15                       XDMAC_GD_DI15_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI15_Msk instead */
#define XDMAC_GD_DI16_Pos                   16                                             /**< (XDMAC_GD) XDMAC Channel 16 Disable Bit Position */
#define XDMAC_GD_DI16_Msk                   (_U_(0x1) << XDMAC_GD_DI16_Pos)                /**< (XDMAC_GD) XDMAC Channel 16 Disable Bit Mask */
#define XDMAC_GD_DI16                       XDMAC_GD_DI16_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI16_Msk instead */
#define XDMAC_GD_DI17_Pos                   17                                             /**< (XDMAC_GD) XDMAC Channel 17 Disable Bit Position */
#define XDMAC_GD_DI17_Msk                   (_U_(0x1) << XDMAC_GD_DI17_Pos)                /**< (XDMAC_GD) XDMAC Channel 17 Disable Bit Mask */
#define XDMAC_GD_DI17                       XDMAC_GD_DI17_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI17_Msk instead */
#define XDMAC_GD_DI18_Pos                   18                                             /**< (XDMAC_GD) XDMAC Channel 18 Disable Bit Position */
#define XDMAC_GD_DI18_Msk                   (_U_(0x1) << XDMAC_GD_DI18_Pos)                /**< (XDMAC_GD) XDMAC Channel 18 Disable Bit Mask */
#define XDMAC_GD_DI18                       XDMAC_GD_DI18_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI18_Msk instead */
#define XDMAC_GD_DI19_Pos                   19                                             /**< (XDMAC_GD) XDMAC Channel 19 Disable Bit Position */
#define XDMAC_GD_DI19_Msk                   (_U_(0x1) << XDMAC_GD_DI19_Pos)                /**< (XDMAC_GD) XDMAC Channel 19 Disable Bit Mask */
#define XDMAC_GD_DI19                       XDMAC_GD_DI19_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI19_Msk instead */
#define XDMAC_GD_DI20_Pos                   20                                             /**< (XDMAC_GD) XDMAC Channel 20 Disable Bit Position */
#define XDMAC_GD_DI20_Msk                   (_U_(0x1) << XDMAC_GD_DI20_Pos)                /**< (XDMAC_GD) XDMAC Channel 20 Disable Bit Mask */
#define XDMAC_GD_DI20                       XDMAC_GD_DI20_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI20_Msk instead */
#define XDMAC_GD_DI21_Pos                   21                                             /**< (XDMAC_GD) XDMAC Channel 21 Disable Bit Position */
#define XDMAC_GD_DI21_Msk                   (_U_(0x1) << XDMAC_GD_DI21_Pos)                /**< (XDMAC_GD) XDMAC Channel 21 Disable Bit Mask */
#define XDMAC_GD_DI21                       XDMAC_GD_DI21_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI21_Msk instead */
#define XDMAC_GD_DI22_Pos                   22                                             /**< (XDMAC_GD) XDMAC Channel 22 Disable Bit Position */
#define XDMAC_GD_DI22_Msk                   (_U_(0x1) << XDMAC_GD_DI22_Pos)                /**< (XDMAC_GD) XDMAC Channel 22 Disable Bit Mask */
#define XDMAC_GD_DI22                       XDMAC_GD_DI22_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI22_Msk instead */
#define XDMAC_GD_DI23_Pos                   23                                             /**< (XDMAC_GD) XDMAC Channel 23 Disable Bit Position */
#define XDMAC_GD_DI23_Msk                   (_U_(0x1) << XDMAC_GD_DI23_Pos)                /**< (XDMAC_GD) XDMAC Channel 23 Disable Bit Mask */
#define XDMAC_GD_DI23                       XDMAC_GD_DI23_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use XDMAC_GD_DI23_Msk instead */
#define XDMAC_GD_MASK                       _U_(0xFFFFFF)                                  /**< \deprecated (XDMAC_GD) Register MASK  (Use XDMAC_GD_Msk instead)  */
#define XDMAC_GD_Msk                        _U_(0xFFFFFF)                                  /**< (XDMAC_GD) Register Mask  */

#define XDMAC_GD_DI_Pos                     0                                              /**< (XDMAC_GD Position) XDMAC Channel 23 Disable Bit */
#define XDMAC_GD_DI_Msk                     (_U_(0xFFFFFF) << XDMAC_GD_DI_Pos)             /**< (XDMAC_GD Mask) DI */
#define XDMAC_GD_DI(value)                  (XDMAC_GD_DI_Msk & ((value) << XDMAC_GD_DI_Pos))  

/* -------- XDMAC_GS : (XDMAC Offset: 0x24) (R/ 32) Global Channel Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ST0:1;                     /**< bit:      0  XDMAC Channel 0 Status Bit               */
    uint32_t ST1:1;                     /**< bit:      1  XDMAC Channel 1 Status Bit               */
    uint32_t ST2:1;                     /**< bit:      2  XDMAC Channel 2 Status Bit               */
    uint32_t ST3:1;                     /**< bit:      3  XDMAC Channel 3 Status Bit               */
    uint32_t ST4:1;                     /**< bit:      4  XDMAC Channel 4 Status Bit               */
    uint32_t ST5:1;                     /**< bit:      5  XDMAC Channel 5 Status Bit               */
    uint32_t ST6:1;                     /**< bit:      6  XDMAC Channel 6 Status Bit               */
    uint32_t ST7:1;                     /**< bit:      7  XDMAC Channel 7 Status Bit               */
    uint32_t ST8:1;                     /**< bit:      8  XDMAC Channel 8 Status Bit               */
    uint32_t ST9:1;                     /**< bit:      9  XDMAC Channel 9 Status Bit               */
    uint32_t ST10:1;                    /**< bit:     10  XDMAC Channel 10 Status Bit              */
    uint32_t ST11:1;                    /**< bit:     11  XDMAC Channel 11 Status Bit              */
    uint32_t ST12:1;                    /**< bit:     12  XDMAC Channel 12 Status Bit              */
    uint32_t ST13:1;                    /**< bit:     13  XDMAC Channel 13 Status Bit              */
    uint32_t ST14:1;                    /**< bit:     14  XDMAC Channel 14 Status Bit              */
    uint32_t ST15:1;                    /**< bit:     15  XDMAC Channel 15 Status Bit              */
    uint32_t ST16:1;                    /**< bit:     16  XDMAC Channel 16 Status Bit              */
    uint32_t ST17:1;                    /**< bit:     17  XDMAC Channel 17 Status Bit              */
    uint32_t ST18:1;                    /**< bit:     18  XDMAC Channel 18 Status Bit              */
    uint32_t ST19:1;                    /**< bit:     19  XDMAC Channel 19 Status Bit              */
    uint32_t ST20:1;                    /**< bit:     20  XDMAC Channel 20 Status Bit              */
    uint32_t ST21:1;                    /**< bit:     21  XDMAC Channel 21 Status Bit              */
    uint32_t ST22:1;                    /**< bit:     22  XDMAC Channel 22 Status Bit              */
    uint32_t ST23:1;                    /**< bit:     23  XDMAC Channel 23 Status Bit              */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t ST:24;                     /**< bit:  0..23  XDMAC Channel 23 Status Bit              */
    uint32_t :8;                        /**< bit: 24..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} XDMAC_GS_Type;
